export default {
  // 所有通知
  notice: {
    n: "注意",
    n1: "请检查是否已连接  钱包插件",
    n2: "获取 eth chainID 失败",
    n7: "请先创建 Eth 账户",
    n8: "获取 ETH 地址失败",
    n9: "未连接账户",
    n10: "您已切换网络,请等待刷新数据",
    n11: "请检查是否已安装钱包插件",
    n12: "初始化以太坊钱包失败",
    n29: "输入的数量大于余额",
    n30: "输入的数量不能为空",
    n31: "输入的数量需要大于0",
    n32: "发送交易失败",
    n33: "发送交易成功",
    n36: '地址已复制',
    n37: '钱包未连接',
    n38: '请先连接钱包',
    n39: '网络连接不一致',
    n40: '请在钱包中切换至Heco主网',
    n41: '钱包已连接',
    n42: '成功',
    n43: '失败',
    swapNotice:{
      n1:'输入的数量必须为数字',
      n2:'输入的数量需要大于0并且小于余额',
      n3:'交易取消',
      n4:'授权取消',
      n5:'获取手续费失败或逻辑异常',
    },
    buidrNotice:{
      n1:'请输入正确的数量',
      n2:'授权取消',
      n3:'发送交易失败',
      n4:'输入的数量需要大于0并且小于余额+手续费'
    }
  },
  header: {
    nav: {
      Buildr: '铸造',
      Exchange: '交易',
      Earn: '收益挖矿',
      Earn1: '挖矿',
      Bridge: '跨链',
      Docs:'教程',
      chart: '行情'
    },
    connectWallet:'连接钱包',
    copyAddress: '复制地址',
    changeWallet: '更换钱包',
    Disconnect: '解除连接',
    AddLambwallet:'添加至钱包',
    wechat: '微信',
  },
  check: {
    notice: 'LambSwap 智能合约已通过 Armors 审核'
  }
};
